lf2/Klausur/Klausur.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="de" xml:lang="de">
<head>
<!-- 2023-01-08 Sun 11:20 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>LF2 Klausur</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://gongzhitaao.org/orgcss/org.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">LF2 Klausur</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Inhaltsverzeichnis</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org660ebe8">S.100 Aufgabe 3</a></li>
<li><a href="#org407c3c1">S. 100 Aufgabe 4</a></li>
<li><a href="#org8b97c2a">S.103 Aufgabe 6</a></li>
<li><a href="#org023360b">S.109 Aufgabe 10.3 b</a></li>
<li><a href="#orgfcd4bf5">S.110 11.1</a></li>
<li><a href="#org88de4ed">S. 111 12.1</a></li>
<li><a href="#org6ae2420">S.112 13.2</a></li>
<li><a href="#orgdafed42">S.100 Aufgabe 3</a></li>
<li><a href="#org90284c0">S. 100 Aufgabe 4</a></li>
<li><a href="#org60c1fe9">S.103 Aufgabe 6</a></li>
<li><a href="#orgf80c8a8">S.109 Aufgabe 10.3 b</a></li>
<li><a href="#org2bc4279">S.110 11.1</a></li>
<li><a href="#org7ffa054">S. 111 12.1</a></li>
<li><a href="#orgc532dfe">S.112 13.2</a></li>
</ul>
</div>
</div>

<div id="outline-container-org660ebe8" class="outline-2">
<h2 id="org660ebe8">S.100 Aufgabe 3</h2>
<div class="outline-text-2" id="text-org660ebe8">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">1.</th>
<th scope="col" class="org-left">Mainboard (Motherboard)</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">2.</td>
<td class="org-left">CPU</td>
</tr>

<tr>
<td class="org-right">3.</td>
<td class="org-left">RAM</td>
</tr>

<tr>
<td class="org-right">4.</td>
<td class="org-left">ROM</td>
</tr>

<tr>
<td class="org-right">5.</td>
<td class="org-left">BIOS</td>
</tr>

<tr>
<td class="org-right">6.</td>
<td class="org-left">GUI</td>
</tr>

<tr>
<td class="org-right">7.</td>
<td class="org-left">Taktgeber (Clock)</td>
</tr>

<tr>
<td class="org-right">8.</td>
<td class="org-left">OS (Operating System)</td>
</tr>

<tr>
<td class="org-right">9.</td>
<td class="org-left">VMM (Virtual Machine Monitor)</td>
</tr>

<tr>
<td class="org-right">10.</td>
<td class="org-left">EEPROM</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org407c3c1" class="outline-2">
<h2 id="org407c3c1">S. 100 Aufgabe 4</h2>
<div class="outline-text-2" id="text-org407c3c1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">A.</th>
<th scope="col" class="org-left">PCIe</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">B.</td>
<td class="org-left">I/O-Panel</td>
</tr>

<tr>
<td class="org-left">C.</td>
<td class="org-left">CPU-Sockel</td>
</tr>

<tr>
<td class="org-left">D.</td>
<td class="org-left">RAM-Slots</td>
</tr>

<tr>
<td class="org-left">E.</td>
<td class="org-left">SATA-Anschlüsse</td>
</tr>
</tbody>
</table>

<p>
Was ist ein CMOS?
</p>

<p>
Was ist ein RISC-Prozessor?
</p>

<p>
Unterschied SAS und SATA.
</p>
</div>
</div>

<div id="outline-container-org8b97c2a" class="outline-2">
<h2 id="org8b97c2a">S.103 Aufgabe 6</h2>
<div class="outline-text-2" id="text-org8b97c2a">
<ol class="org-ol">
<li>RAM</li>

<li>EPROM</li>

<li>UEFI</li>

<li>GUI</li>

<li>Clock</li>

<li>VMM</li>

<li>Chipsatz</li>

<li>Formfaktor</li>

<li>CPU-Sockel</li>

<li>ATX</li>

<li>Cache</li>

<li>GPU</li>

<li>Kern(e) / Core(s)</li>

<li>Intel</li>

<li>AMD</li>

<li>ARM / HP</li>

<li>ALU</li>

<li>nm (Nanometer)</li>

<li>Fax / Bus</li>

<li>Hertz (Hz)</li>

<li>Boost</li>

<li>TDP (thermal design power)</li>

<li>Kühler</li>

<li>GPGPU</li>
</ol>

<p>
Aufgabe 6.2
</p>

<ol class="org-ol">
<li>D</li>

<li>F</li>

<li>E</li>

<li>A</li>

<li>C</li>

<li>B</li>
</ol>

<p>
Aufgabe 8.2
</p>

<p>
A: PS/2
</p>

<p>
B: USB 2.0
</p>

<p>
C:Hdmi
</p>

<p>
D:Display Port
</p>

<p>
E:VgA
</p>

<p>
F: DVI
</p>

<p>
G: USB 3.0
</p>

<p>
H: RJ 45
</p>

<p>
I:Aux / Audio
</p>

<p>
Aufgabe 8.3 a
</p>

<p>
Ampere umwandeln = 120mA=0.12A
</p>

<p>
100mA=0.1A
</p>

<p>
140mA=0.14A
</p>

<p>
60mA= 0.06A
</p>

<p>
P=i * u
</p>

<p>
P=Leistung(Watt)
</p>

<p>
I= Stromstärke(Ampere)
</p>

<p>
U= Spannung(Volt)
</p>

<p>
P= 0.52* 5
</p>

<p>
P=2.6 W
</p>

<p>
Aufgabe 8.3 b
</p>

<p>
Aktiven USB-Hub anschließen.
</p>

<p>
Aufgabe 9.1
</p>

<p>
Office Rechner Tower= Intern,300Watt, Aktiv
</p>

<p>
Office Rechner, Notebook Slim=Extern, 300Watt, Passiv
</p>

<p>
High-End-PC Desktop= Intern, 650Watt, Aktiv
</p>

<p>
High-End-Notebook= Extern, 300 Watt, Passiv
</p>

<p>
Aufgabe 10 .3 a
</p>

<ol class="org-ol">
<li>3.5“</li>

<li>HDD SSD</li>

<li>Extern, Intern</li>

<li>Hybrid</li>

<li>M.2, SATA, USB, PCI-e, SAS</li>

<li>Western digital blue 500gb m.2 ssd</li>

<li>Western digital black 2TB nvme ssd</li>
</ol>
</div>
</div>

<div id="outline-container-org023360b" class="outline-2">
<h2 id="org023360b">S.109 Aufgabe 10.3 b</h2>
<div class="outline-text-2" id="text-org023360b">
<p>
Übersprungen
</p>

<p>
10.3 c
</p>

<p>
Überspringen
</p>
</div>
</div>

<div id="outline-container-orgfcd4bf5" class="outline-2">
<h2 id="orgfcd4bf5">S.110 11.1</h2>
<div class="outline-text-2" id="text-orgfcd4bf5">
<ol class="org-ol">
<li>Falsch</li>

<li>Falsch</li>

<li>Richtig</li>

<li>Falsch</li>

<li>Richtig</li>

<li>Falsch</li>

<li>Richtig</li>

<li>Richtig</li>

<li>Richtig</li>

<li>Richtig</li>

<li>Falsch</li>

<li>Falsch</li>

<li>Richtig</li>

<li>Richtig</li>

<li>Richtig</li>

<li>Falsch</li>
</ol>

<p>
11.2
</p>

<p>
Reihe 1: VGA, miniDVI, HDMI, Audio, Optical audio
</p>

<p>
Reihe 2: DVI-I, DVI-D, Thunderbolt, Displayport, miniDP
</p>
</div>
</div>

<div id="outline-container-org88de4ed" class="outline-2">
<h2 id="org88de4ed">S. 111 12.1</h2>
<div class="outline-text-2" id="text-org88de4ed">
<p>
1 = C
</p>

<p>
2 = B
</p>

<p>
3 = A
</p>

<p>
12.2
</p>

<ol class="org-ol">
<li>Hotkey/shortcut</li>

<li>USB</li>

<li>Touchpad</li>

<li>Handballenauflage (Wrist rest)</li>

<li>Grafiktablet</li>
</ol>

<blockquote>
<p>
13.1
</p>
</blockquote>

<ol class="org-ol">
<li>24-27 Zoll</li>

<li>Full HD 1920 x 1080</li>

<li>1ms</li>

<li>VA Panel</li>

<li>IPS-Panel</li>

<li>35°</li>

<li>HDMI, Displayport</li>

<li>Energystar label</li>

<li>DP</li>
</ol>
</div>
</div>

<div id="outline-container-org6ae2420" class="outline-2">
<h2 id="org6ae2420">S.112 13.2</h2>
<div class="outline-text-2" id="text-org6ae2420">
<p>
Curved screen: Gebogenes Display
</p>

<p>
Panel: Farb &amp; Kontrast Wiedergabe
</p>

<p>
Tilt-Eigenschaft: Neigungswinkel
</p>

<p>
Swivel-Eigenschaft: Waagerecht Bildschirm drehen
</p>

<p>
Pivot-Eigenschaft: Monitor in Hochformat setzen
</p>

<p>
MHL-Port: Schnittstelle für Mobilgeräte
</p>

<p>
VESA: Standard für Befestigungsmöglichkeiten
</p>

<p>
13.4
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Eher gut</th>
<th scope="col" class="org-left">Eher schlecht</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">30-150W</td>
<td class="org-left">Über 150W</td>
</tr>

<tr>
<td class="org-left">1-5ms</td>
<td class="org-left">Über 5ms</td>
</tr>

<tr>
<td class="org-left">Ab 1080p</td>
<td class="org-left">Unter 1080p</td>
</tr>

<tr>
<td class="org-left">700:1</td>
<td class="org-left">Unter 700:1</td>
</tr>

<tr>
<td class="org-left">IPS-Panel</td>
<td class="org-left">VA-Panel</td>
</tr>

<tr>
<td class="org-left">250-300 cd/m²</td>
<td class="org-left">Alles über 250-300 cd/m²</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgdafed42" class="outline-2">
<h2 id="orgdafed42">S.100 Aufgabe 3</h2>
<div class="outline-text-2" id="text-orgdafed42">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">1.</th>
<th scope="col" class="org-left">Mainboard (Motherboard)</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">2.</td>
<td class="org-left">CPU</td>
</tr>

<tr>
<td class="org-right">3.</td>
<td class="org-left">RAM</td>
</tr>

<tr>
<td class="org-right">4.</td>
<td class="org-left">ROM</td>
</tr>

<tr>
<td class="org-right">5.</td>
<td class="org-left">BIOS</td>
</tr>

<tr>
<td class="org-right">6.</td>
<td class="org-left">GUI</td>
</tr>

<tr>
<td class="org-right">7.</td>
<td class="org-left">Taktgeber (Clock)</td>
</tr>

<tr>
<td class="org-right">8.</td>
<td class="org-left">OS (Operating System)</td>
</tr>

<tr>
<td class="org-right">9.</td>
<td class="org-left">VMM (Virtual Machine Monitor)</td>
</tr>

<tr>
<td class="org-right">10.</td>
<td class="org-left">EEPROM</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org90284c0" class="outline-2">
<h2 id="org90284c0">S. 100 Aufgabe 4</h2>
<div class="outline-text-2" id="text-org90284c0">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">A.</th>
<th scope="col" class="org-left">PCIe</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">B.</td>
<td class="org-left">I/O-Panel</td>
</tr>

<tr>
<td class="org-left">C.</td>
<td class="org-left">CPU-Sockel</td>
</tr>

<tr>
<td class="org-left">D.</td>
<td class="org-left">RAM-Slots</td>
</tr>

<tr>
<td class="org-left">E.</td>
<td class="org-left">SATA-Anschlüsse</td>
</tr>
</tbody>
</table>

<p>
Was ist ein CMOS?
</p>

<p>
Was ist ein RISC-Prozessor?
</p>

<p>
Unterschied SAS und SATA.
</p>
</div>
</div>

<div id="outline-container-org60c1fe9" class="outline-2">
<h2 id="org60c1fe9">S.103 Aufgabe 6</h2>
<div class="outline-text-2" id="text-org60c1fe9">
<ol class="org-ol">
<li>RAM</li>

<li>EPROM</li>

<li>UEFI</li>

<li>GUI</li>

<li>Clock</li>

<li>VMM</li>

<li>Chipsatz</li>

<li>Formfaktor</li>

<li>CPU-Sockel</li>

<li>ATX</li>

<li>Cache</li>

<li>GPU</li>

<li>Kern(e) / Core(s)</li>

<li>Intel</li>

<li>AMD</li>

<li>ARM / HP</li>

<li>ALU</li>

<li>nm (Nanometer)</li>

<li>Fax / Bus</li>

<li>Hertz (Hz)</li>

<li>Boost</li>

<li>TDP (thermal design power)</li>

<li>Kühler</li>

<li>GPGPU</li>
</ol>

<p>
Aufgabe 6.2
</p>

<ol class="org-ol">
<li>D</li>

<li>F</li>

<li>E</li>

<li>A</li>

<li>C</li>

<li>B</li>
</ol>

<p>
Aufgabe 8.2
</p>

<p>
A: PS/2
</p>

<p>
B: USB 2.0
</p>

<p>
C:Hdmi
</p>

<p>
D:Display Port
</p>

<p>
E:VgA
</p>

<p>
F: DVI
</p>

<p>
G: USB 3.0
</p>

<p>
H: RJ 45
</p>

<p>
I:Aux / Audio
</p>

<p>
Aufgabe 8.3 a
</p>

<p>
Ampere umwandeln = 120mA=0.12A
</p>

<p>
100mA=0.1A
</p>

<p>
140mA=0.14A
</p>

<p>
60mA= 0.06A
</p>

<p>
P=i * u
</p>

<p>
P=Leistung(Watt)
</p>

<p>
I= Stromstärke(Ampere)
</p>

<p>
U= Spannung(Volt)
</p>

<p>
P= 0.52* 5
</p>

<p>
P=2.6 W
</p>

<p>
Aufgabe 8.3 b
</p>

<p>
Aktiven USB-Hub anschließen.
</p>

<p>
Aufgabe 9.1
</p>

<p>
Office Rechner Tower= Intern,300Watt, Aktiv
</p>

<p>
Office Rechner, Notebook Slim=Extern, 300Watt, Passiv
</p>

<p>
High-End-PC Desktop= Intern, 650Watt, Aktiv
</p>

<p>
High-End-Notebook= Extern, 300 Watt, Passiv
</p>

<p>
Aufgabe 10 .3 a
</p>

<ol class="org-ol">
<li>3.5“</li>

<li>HDD SSD</li>

<li>Extern, Intern</li>

<li>Hybrid</li>

<li>M.2, SATA, USB, PCI-e, SAS</li>

<li>Western digital blue 500gb m.2 ssd</li>

<li>Western digital black 2TB nvme ssd</li>
</ol>
</div>
</div>

<div id="outline-container-orgf80c8a8" class="outline-2">
<h2 id="orgf80c8a8">S.109 Aufgabe 10.3 b</h2>
<div class="outline-text-2" id="text-orgf80c8a8">
<p>
Übersprungen
</p>

<p>
10.3 c
</p>

<p>
Überspringen
</p>
</div>
</div>

<div id="outline-container-org2bc4279" class="outline-2">
<h2 id="org2bc4279">S.110 11.1</h2>
<div class="outline-text-2" id="text-org2bc4279">
<ol class="org-ol">
<li>Falsch</li>

<li>Falsch</li>

<li>Richtig</li>

<li>Falsch</li>

<li>Richtig</li>

<li>Falsch</li>

<li>Richtig</li>

<li>Richtig</li>

<li>Richtig</li>

<li>Richtig</li>

<li>Falsch</li>

<li>Falsch</li>

<li>Richtig</li>

<li>Richtig</li>

<li>Richtig</li>

<li>Falsch</li>
</ol>

<p>
11.2
</p>

<p>
Reihe 1: VGA, miniDVI, HDMI, Audio, Optical audio
</p>

<p>
Reihe 2: DVI-I, DVI-D, Thunderbolt, Displayport, miniDP
</p>
</div>
</div>

<div id="outline-container-org7ffa054" class="outline-2">
<h2 id="org7ffa054">S. 111 12.1</h2>
<div class="outline-text-2" id="text-org7ffa054">
<p>
1 = C
</p>

<p>
2 = B
</p>

<p>
3 = A
</p>

<p>
12.2
</p>

<ol class="org-ol">
<li>Hotkey/shortcut</li>

<li>USB</li>

<li>Touchpad</li>

<li>Handballenauflage (Wrist rest)</li>

<li>Grafiktablet</li>
</ol>

<blockquote>
<p>
13.1
</p>
</blockquote>

<ol class="org-ol">
<li>24-27 Zoll</li>

<li>Full HD 1920 x 1080</li>

<li>1ms</li>

<li>VA Panel</li>

<li>IPS-Panel</li>

<li>35°</li>

<li>HDMI, Displayport</li>

<li>Energystar label</li>

<li>DP</li>
</ol>
</div>
</div>

<div id="outline-container-orgc532dfe" class="outline-2">
<h2 id="orgc532dfe">S.112 13.2</h2>
<div class="outline-text-2" id="text-orgc532dfe">
<p>
Curved screen: Gebogenes Display
</p>

<p>
Panel: Farb &amp; Kontrast Wiedergabe
</p>

<p>
Tilt-Eigenschaft: Neigungswinkel
</p>

<p>
Swivel-Eigenschaft: Waagerecht Bildschirm drehen
</p>

<p>
Pivot-Eigenschaft: Monitor in Hochformat setzen
</p>

<p>
MHL-Port: Schnittstelle für Mobilgeräte
</p>

<p>
VESA: Standard für Befestigungsmöglichkeiten
</p>

<p>
13.4
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Eher gut</th>
<th scope="col" class="org-left">Eher schlecht</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">30-150W</td>
<td class="org-left">Über 150W</td>
</tr>

<tr>
<td class="org-left">1-5ms</td>
<td class="org-left">Über 5ms</td>
</tr>

<tr>
<td class="org-left">Ab 1080p</td>
<td class="org-left">Unter 1080p</td>
</tr>

<tr>
<td class="org-left">700:1</td>
<td class="org-left">Unter 700:1</td>
</tr>

<tr>
<td class="org-left">IPS-Panel</td>
<td class="org-left">VA-Panel</td>
</tr>

<tr>
<td class="org-left">250-300 cd/m²</td>
<td class="org-left">Alles über 250-300 cd/m²</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
</body>
</html>